:PROPERTIES:
:ID:       6f4d2291-627c-40b6-a328-a52be2260a31
:END:
#+title: Python

* TODO Learning Python Basics https://github.com/Asabeneh/30-Days-Of-Python/tree/master
DEADLINE: <2026-01-31 Sat>
:LOGBOOK:
CLOCK: [2025-12-27 Sat 20:24]--[2025-12-27 Sat 21:44] =>  1:20
CLOCK: [2025-12-26 Fri 16:30]--[2025-12-26 Fri 17:41] =>  1:11
:END:
* 30 Days of Python
** Day 1
*** Operators
**** Arithmatic Operators
#+BEGIN_SRC python :results output

print(1 + 1) # addition
print(1 - 1) # subtraction
print(3 * 4) # multiplication
print(12 / 3) # division
print( 2 ** 4 ) # the same as 2^4 exponents

# if you divide 11 / 3 you get 3.66666666666
# but sometimes you dont want the trailing number
# so you do floor division this goes to 3
print( 11 // 3 ) # floor division

# modulous operation is the remainder operation (gives remainer)
print( 22 % 3) # modulous


#+END_SRC

#+RESULTS:
: 2
: 0
: 12
: 4.0
: 16
: 3
: 1

**** Comparison Operators

#+BEGIN_SRC python :results output
# Comparison operators

x = True
y = False
# sidenote look up ASCII table for character values

print("x = ", x , ", y = ", y)
print("== ",x == y) # equals operator
print("!= ", x != y ) # not equals operator
print("> ", x > y) # greater than operator
print("< ", x < y) # less than operator
print(">= ", x >= y) # greater than or equal to operator
print("<= ", x <= y) # less than or equal to operator



#+END_SRC

#+RESULTS:
: x =  True , y =  False
: ==  False
: !=  True
: >  True
: <  False
: >=  True
: <=  False

**** Logical Operators

#+BEGIN_SRC python :results output



# AND
print("| X | Y | X AND Y")
print("| F | F | ", False and False, )
print("| F | T | ", False and True, )
print("| T | F | ", True and False, )
print("| T | T | ", True and True, )
# OR
print("| X | Y | X OR Y")
print("| F | F | ", False or False, )
print("| F | T | ", False or True, )
print("| T | F | ", True or False, )
print("| T | T | ", True or True, )

# NOT
print(not ( (1 < 3) and (0 > -1)))

#+END_SRC

#+RESULTS:
#+begin_example
| X | Y | X AND Y
| F | F |  False
| F | T |  False
| T | F |  False
| T | T |  True
| X | Y | X OR Y
| F | F |  False
| F | T |  True
| T | F |  True
| T | T |  True
False
#+end_example

*** Data Types

#+BEGIN_SRC python :results output

# type() <- tells you what python type the parameter is
print(type(1)) #int
print(type(1.1)) #float
print(type("qpwiupfjap")) # string
print(type([])) # list
print(type({'a','b','c'})) # set
print(type((1,3,"4"))) # tuple
print(type(3 == 3))  # bool

#+END_SRC

#+RESULTS:
: <class 'int'>
: <class 'float'>
: <class 'str'>
: <class 'list'>
: <class 'set'>
: <class 'tuple'>
: <class 'bool'>

*** Python Problem
You’re writing a small program to determine whether a student is allowed into a neuroscience research lab.

A student may enter the lab only if ALL of the following are true:
- The student is at least 18 years old
- The student has completed lab safety training
- The student is not on academic probation
- The current time is between 8 AM and 8 PM (inclusive)

#+BEGIN_SRC python :results output
age = 20
completed_training = True
on_probation = False
curr_hour = 10

def foo():
    if(age >= 18 and completed_training and (not on_probation) and (curr_hour > 8 and curr_hour < 20)):
        print("Allowed")
    else:
        print("Not Allowed")

foo()
#+END_SRC

#+RESULTS:
: Allowed
** Day 2
*** Built in functions
*** Variables
** Day 3
*** Exercise
#+BEGIN_SRC python :results output
height = 30
width = 10
area = height * width

print("Area", area)

#+END_SRC

#+RESULTS:
: Area 300
** Day 4
*** Creating a string
#+BEGIN_SRC python :results output
letter = 'P' #creating a string with single quotes
print(letter)
print(len(letter))

greeting = 'Hello, World!'
print(greeting)
print(len(greeting))

sentence = "I hope you are enjoying 30 days of Python!"
print(sentence)
#+END_SRC

#+RESULTS:
: P
: 1
: Hello, World!
: 13
: I hope you are enjoying 30 days of Python!

#+BEGIN_SRC python :results output
multiline_string =''' I am a teacher and enjoy teaching
That is why i created 30 Days
of python
'''

print(multiline_string)

#+END_SRC

#+RESULTS:
:  I am a teacher and enjoy teaching
: That is why i created 30 Days
: of python
:
*** String Concatination
#+BEGIN_SRC python :results output
first_name = 'Jorge'
last_name = 'Ramirez'
space = ' '

full_name = first_name + space + last_name

print(full_name)

print(len(first_name)) # 5
print(len(last_name)) # 7

print(len(first_name) > len(last_name)) # false

print(len(full_name)) # 13
#+END_SRC

#+RESULTS:
: Jorge Ramirez
: 5
: 7
: False
: 13
*** Escape Sequences in Strings
#+BEGIN_SRC python :results output
print('I hope everyone is enjoying the Python Challenge.\n Are you?')

print('Days\tTopics\tExercisis')
print('Day 1\t5\t20')
print('Day 2\t15\t20')
print('Day 3\t53\t202')
print('Day 4\t54\t220')

print("Make the \"string\"")


#+END_SRC

#+RESULTS:
: I hope everyone is enjoying the Python Challenge.
:  Are you?
: Days	Topics	Exercisis
: Day 1	5	20
: Day 2	15	20
: Day 3	53	202
: Day 4	54	220
: Make the "string"
*** String Formatting
#+BEGIN_SRC python :results output
radius = 10
pi = 3.14
area = pi * radius ** 2
formated_string = 'The area of circle with a radius %d is %.1f.' %(radius, area)
print(formated_string)
#+END_SRC

#+RESULTS:
: The area of circle with a radius 10 is 314.0.
** Day 5
*** Creating Lists
#+BEGIN_SRC python :results output
#syntax
empty_list = list()
print(len(empty_list))
print(empty_list)
#+END_SRC

#+RESULTS:
: 0
: []

#+BEGIN_SRC python :results output
empty_list = []
print(len(empty_list))
print(empty_list)
#+END_SRC

#+RESULTS:
: 0
: []

*** Finding Length of list
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
print('Fruits:', fruits )
print('Number of fruits:', len(fruits))
lst = []
#+END_SRC

#+RESULTS:
: Fruits: ['banana', 'orange', 'mango', 'lemon']
: Number of fruits: 4

*** Accessing Lists Items
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
first_fruit = fruits[0]
print(first_fruit)
second_fruit = fruits[1]
print(second_fruit)
third_fruit = fruits[2]
print(third_fruit)

last_index = len(fruits) - 1
last_fruit = fruits[last_index]
print(last_fruit)
#+END_SRC

#+RESULTS:
: banana
: orange
: mango
: lemon

#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
first_fruit = fruits[-4]
print(first_fruit)
last_fruit = fruits[-1]
print(last_fruit)
#+END_SRC

#+RESULTS:
: banana
: lemon

*** Unpacking Lists
*** Slicing Items from a List

#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
all_fruits = fruits[0:4] # it returns all the fruits
print(all_fruits)
all_fruits_no_end_val = fruits[0:] # dont need to include end value to get rest
print(all_fruits_no_end_val)

orange_and_mango = fruits[1:3]
print(orange_and_mango)
step_list = fruits[::2] # this is a step argument prints out every 2
print(step_list)

print(fruits[::-1])
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['banana', 'orange', 'mango', 'lemon']
: ['orange', 'mango']
: ['banana', 'mango']
: ['lemon', 'mango', 'orange', 'banana']

*** Modifying Lists
#+BEGIN_SRC python :results output

fruits = ['banana', 'orange', 'mango', 'lemon']
print(fruits)
fruits[0] = 'cherry'
print(fruits)
last_index = len(fruits) - 1
fruits[last_index] = 'lime'
print(fruits)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['cherry', 'orange', 'mango', 'lemon']
: ['cherry', 'orange', 'mango', 'lime']

*** Checking Items in a List
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
does_exist = 'banana' in fruits
print(does_exist)  # True
does_exist = 'lime' in fruits
print(does_exist)  # False
#+END_SRC

#+RESULTS:
: True
: False

*** Adding Items to a List
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
print(fruits)
fruits.append('apple')
print(fruits)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['banana', 'orange', 'mango', 'lemon', 'apple']

*** Inserting Items to a List
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
print(fruits)
fruits.insert(1,'apple')
print(fruits)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['banana', 'apple', 'orange', 'mango', 'lemon']

*** Removing Items from A List
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
print(fruits)
fruits.remove('orange')
print(fruits)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['banana', 'mango', 'lemon']

*** Removing Items Using Pop
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
print(fruits)
fruits.pop()
print(fruits)
fruits.pop(0)
print(fruits)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon']
: ['banana', 'orange', 'mango']
: ['orange', 'mango']

*** Removing Items Using Del
- can remove a range of items by ~del fruits[1:3]~
*** Clearing List Items
*** Copying a List
*** Joining Lists
#+BEGIN_SRC python :results output
fruits = ['banana', 'orange', 'mango', 'lemon']
veggies = ['carrot', 'onion', 'potato']
fruits_and_veggies = fruits + veggies
print(fruits_and_veggies)
#+END_SRC

#+RESULTS:
: ['banana', 'orange', 'mango', 'lemon', 'carrot', 'onion', 'potato']

*** Counting Items in a List
*** Finding Index of an Item
*** Reversing a List
*** Sorting List Items
